Documents/ОтражениеНалоговойОтчетностиВРеглУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтражениеНалоговойОтчетностиВРеглУчете</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОПВПодлежитПеречислениюВФонды</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСПодлежитПеречислениюВФонды</xr:Item>
				<xr:Item>AccumulationRegister.ИПНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.СНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМССведенияОДоходах</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.СОСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ИПНРасчетыСБюджетом</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.ОПВСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.СОРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.СНИсчисленный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалогиСборыОтчисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодБК</Name>
							<Comment>Код бюджетной классификации</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатратБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатратБУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатратБУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатратБУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНалогаБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлатежаВБюджет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПлатежейВБюджетИФонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатратНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатратНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатратНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗатратНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНалогаНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговыйКомитет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтражениеНалоговойОтчетностиВРеглУчете/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область УправлениеДоступом

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ОбщегоНазначенияБК.ЗаполнитьНаборыПоОрганизацииСтурктурномуПодразделению(ЭтотОбъект, Таблица, "Организация", "СтруктурноеПодразделение");
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			ДанныеЗаполнения.Удалить("Автор");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
		ДокументОснование = Неопределено;
		ДанныеЗаполнения.Свойство("ДокументОснование", ДокументОснование);
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РегламентированныйОтчет") И ЗначениеЗаполнено(ДокументОснование) Тогда
			ЗаполнитьПоДокументуОснования(ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета(), , , , ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета(), , , ОбъектКопирования.Ссылка);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();

	Если НЕ ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНалогаНаПрибыль(Организация, Дата)
		ИЛИ НЕ УчитыватьКПН Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидУчетаНУ");
		МассивНепроверяемыхРеквизитов.Добавить("ОтражениеВУчете.СчетЗатратНУ");
		МассивНепроверяемыхРеквизитов.Добавить("ОтражениеВУчете.СчетНалогаНУ");

	КонецЕсли;

	ОтражениеДанныхИП = Неопределено;
		
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ДанныеОтчета = ДокументОснование.ДанныеОтчета.Получить();
		мДополнительныеПараметрыОтражения = Неопределено;
		ДанныеОтчета.Свойство("ДополнительныеПараметрыОтражения", мДополнительныеПараметрыОтражения);
		
		мДополнительныеПараметрыОтражения = ?(мДополнительныеПараметрыОтражения = Неопределено, Новый Структура, мДополнительныеПараметрыОтражения);
		мДополнительныеПараметрыОтражения.Свойство("ОтражениеДанныхИП", ОтражениеДанныхИП);
		
	КонецЕсли;
	
	Если ОтражениеДанныхИП <> Истина Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОтражениеВУчете.ФизЛицо");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Посчитать сумму документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = ОтражениеВУчете.Итог("Сумма");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// сохраняем ссылку на этот документ в документе "Регламентированный отчет"
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		СохраненныйДок = ДокументОснование.ПолучитьОбъект();
		ДокументОтражения = СохраненныйДок.ДокументОтраженияВУчете;
		Если ЗначениеЗаполнено(ДокументОтражения) И ДокументОтражения <> Ссылка Тогда
			// отменим запись документа, т.к. для регл.отчета уже создан документ отражения
			ШаблонСообщения = НСтр("ru='Для документа-основания ""%1"" уже введен документ отражения в учете ""%2"".
									   |Запись еще одного документа ""Отражение налоговой отчетности в регл.учете"" не допускается'");
										
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ДокументОснование, ДокументОтражения),
				ЭтотОбъект,
				"ДокументОснование",
				,
				Отказ);
		Иначе // запишем
			СохраненныйДок.ДокументОтраженияВУчете = Ссылка;		
			Попытка 
				СохраненныйДок.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru='Не удалось сохранить регламентированный отчет!'"),
					ЭтотОбъект,
					"ДокументОснование",
					,
					Отказ);
			КонецПопытки;			
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.ОтражениеНалоговойОтчетностиВРеглУчете.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	Документы.ОтражениеНалоговойОтчетностиВРеглУчете.СформироватьДвиженияОтражениеНалоговойОтчетностиВРеглУчете(ПараметрыПроведения.ТаблицаОтражениеВУчете,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);

	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаИПНСведенияОДоходах,   		"ИПНСведенияОДоходах",  				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаИПНРасчетыСБюджетом,   		"ИПНРасчетыСБюджетом",  				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаОПВСведенияОДоходах,   		"ОПВСведенияОДоходах",  				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаОПВРасчетыСФондами,  		    "ОПВРасчетыСФондами",  				    Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаОПВПодлежитПеречислениюВФонды, "ОПВПодлежитПеречислениюВФонды",  		Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаСНСведенияОДоходах,        	"СНСведенияОДоходах",   				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаСНИсчисленный,   	     	    "СНИсчисленный",   				        Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаСОСведенияОДоходах,   		    "СОСведенияОДоходах",   				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаСОРасчетыСФондами, 		    "СОРасчетыСФондами", 				    Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаВОСМССведенияОДоходах,   		"ВОСМССведенияОДоходах",   				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаВОСМСРасчетыСФондами, 		    "ВОСМСРасчетыСФондами", 				Движения, Отказ);
	РасчетЗарплатыСервер.СформироватьДвижения(ПараметрыПроведения.ТаблицаВОСМСПодлежитПеречислениюВФонды, "ВОСМСПодлежитПеречислениюВФонды",  		Движения, Отказ);
		
	// Отражение ПР в НУ 
	ПроцедурыНалоговогоУчета.ОтразитьПостоянныеРазницыВНУ(ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет заполнение документа по документу-основанию
//
Процедура ЗаполнитьПоДокументуОснования(Основание) Экспорт
	
	Документы.ОтражениеНалоговойОтчетностиВРеглУчете.ЗаполнитьДокументПоОснованию(ЭтотОбъект, Основание);

КонецПроцедуры

#КонецЕсли
